[
    {
        "id": 1,
        "programId": 1,
        "name": "Math For the Computer Industry",
        "description": "This course is designed to provide students with the mathematical knowledge and skills required to solve problems in the computer industry. Topics include: algebra. Students will learn to apply mathematical concepts to solve problems in computer programming, networking, and database management.",
        "availableFall": true,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 2,
        "programId": 1,
        "description":"This course is designed to provide students with the essential skills required to work effectively in a team environment. Topics include: team dynamics, communication, problem solving, and conflict resolution. Students will learn to apply these skills to work effectively in a team environment.",
        "name": "Essential skills for team's collaboration",
        "availableFall": true,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 3,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of programming. Topics include: programming languages, data types, control structures, and functions. Students will learn to write programs to solve problems in the computer industry.",
        "name": "programming fundamentals",
        "availableFall": true,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 4,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of the Internet of things. Topics include: sensors, actuators, microcontrollers, and communication protocols. Students will learn to design and implement Internet of things applications.",
        "name": "Internet of things",
        "availableFall": true,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 5,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of the Web and Internet. Topics include: HTML, CSS, JavaScript, and web development tools. Students will learn to design and implement web applications.",
        "name": "Web and Internet fundamentals",
        "availableFall": true,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 6,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of relational databases. Topics include: database design, SQL, and database management systems. Students will learn to design and implement relational databases.",
        "name": "Introduction to relational databases",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": true,
        "availableSummer": true
    },    {
        "id":7 ,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of project management and software development. Topics include: project management methodologies, software development life cycle, and software development tools. Students will learn to manage software development projects.",
        "name": "Project management and software development",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": true,
        "availableSummer": true
    },
    {
        "id": 8,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of web design. Topics include: web design principles, web design tools, and web design technologies. Students will learn to design and implement web sites.",
        "name": "Introduction to web design",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": true,
        "availableSummer": true
    },
    {
        "id": 9,
        "programId": 1,
        "description":"This course is designed to provide students with the fundamental concepts of object oriented programming. Topics include: object oriented programming languages, classes, objects, and inheritance. Students will learn to write object oriented programs.",
        "name": "Introduction to object oriented programming",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": true,
        "availableSummer": true
    },
    {
        "id": 10,
        "programId": 1,
        "name": "Networking essentials",
        "description":"This course is designed to provide students with the fundamental concepts of networking. Topics include: network topologies, network protocols, and network security. Students will learn to design and implement computer networks.",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": true,
        "availableSummer": true
    },
    {
        "id": 11,
        "programId": 1,
        "name": "Relational databases",
        "description":"This course is designed to provide students with the fundamental concepts of relational databases. Topics include: database design, SQL, and database management systems. Students will learn to design and implement relational databases.",
        "availableFall": true,
        "availableWinter": false,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 12,
        "programId": 1,
        "name": "Project management in software development",
        "description":"This course is designed to provide students with the fundamental concepts of project management in software development. Topics include: project management methodologies, software development life cycle, and software development tools. Students will learn to manage software development projects.",
        "availableFall": true,
        "availableWinter": false,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id":13 ,
        "programId": 1,
        "name": "Rapid application development",
        "description":"This course is designed to provide students with the fundamental concepts of rapid application development. Topics include: rapid application development methodologies, rapid application development tools, and rapid application development technologies. Students will learn to design and implement rapid application development projects.",
        "availableFall": true,
        "availableWinter": false,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id":14 ,
        "programId": 1,
        "name": "Web programming",
        "description":"This course is designed to provide students with the fundamental concepts of web programming. Topics include: web programming languages, web programming frameworks, and web programming tools. Students will learn to design and implement web applications.",
        "availableFall": true,
        "availableWinter": false,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 15,
        "programId": 1,
        "name": "Object oriented programming",
        "description":"This course is designed to provide students with the fundamental concepts of object oriented programming. Topics include: object oriented programming languages, classes, objects, and inheritance. Students will learn to write object oriented programs.",
        "availableFall": true,
        "availableWinter": false,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 16,
        "programId": 1,
        "name": "Introduction to games and simulation programming",
        "description":"This course is designed to provide students with the fundamental concepts of games and simulation programming. Topics include: games and simulation programming languages, games and simulation programming frameworks, and games and simulation programming tools. Students will learn to design and implement games and simulation programs.",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id":17 ,
        "programId": 1,
        "name": "Mobile application development",
        "description":"This course is designed to provide students with the fundamental concepts of mobile application development. Topics include: mobile application development languages, mobile application development frameworks, and mobile application development tools. Students will learn to design and implement mobile applications.",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id":18 ,
        "programId": 1,
        "name": "Algorithms and data structures",
        "description":"This course is designed to provide students with the fundamental concepts of algorithms and data structures. Topics include: algorithms, data structures, and algorithm analysis. Students will learn to design and implement algorithms and data structures.",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id":19,
        "programId": 1,
        "name": "Software development capstone project",
        "description":"This course is designed to provide students with the opportunity to apply the knowledge and skills acquired in the program to a real-world software development project. Students will work in teams to design and implement a software application.",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    },
    {
        "id": 20,
        "programId": 1,
        "name": "Enterprise computing",
        "description":"This course is designed to provide students with the fundamental concepts of enterprise computing. Topics include: enterprise computing architectures, enterprise computing technologies, and enterprise computing tools. Students will learn to design and implement enterprise computing solutions.",
        "availableFall": false,
        "availableWinter": true,
        "availableSpring": false,
        "availableSummer": false
    }
]