[
    {
        "id": 1,
        "userId": 1,
        "programId": 1,
        "name": "Math For the Computer Industry",
        "description": "This course is designed to provide students with the mathematical knowledge and skills required to solve problems in the computer industry. Topics include: algebra. Students will learn to apply mathematical concepts to solve problems in computer programming, networking, and database management.",
        "userTermId": 1,
        "termSeason": "Fall"
    },
    {
        "id": 2,
        "userId": 1,
        "programId": 1,
        "name": "Introduction to Computer Programming",
        "description": "This course is designed to provide students with the knowledge and skills required to write computer programs. Topics include: programming languages, data types, control structures, functions, and arrays. Students will learn to write programs in a variety of programming languages.",
        "userTermId": 1,
        "termSeason": "Fall"
    },
    {
        "id": 3,
        "userId": 1,
        "programId": 1,
        "name": "Introduction to Computer Networking",
        "description": "This course is designed to provide students with the knowledge and skills required to design and implement computer networks. Topics include: network topologies, network protocols, network security, and network management. Students will learn to design and implement computer networks.",
        "userTermId": 1,
        "termSeason": "Fall"
    },
    {
        "id": 4,
        "userId": 1,
        "programId": 1,
        "name": "Introduction to Database Management",
        "description": "This course is designed to provide students with the knowledge and skills required to design and implement database management systems. Topics include: database design, database normalization, database security, and database management. Students will learn to design and implement database management systems.",
        "userTermId": 1,
        "termSeason": "Fall"
    },
    {
        "id": 5,
        "userId": 1,
        "programId": 1,
        "name": "Introduction to Web Development",
        "description": "This course is designed to provide students with the knowledge and skills required to design and implement web applications. Topics include: web design, web development, web security, and web management. Students will learn to design and implement web applications.",
        "userTermId": 2,
        "termSeason": "Winter"
    },
    {
        "id": 6,
        "userId": 1,
        "programId": 2,
        "name": "Introduction to Mobile Development",
        "description": "This course is designed to provide students with the knowledge and skills required to design and implement mobile applications. Topics include: mobile design, mobile development, mobile security, and mobile management. Students will learn to design and implement mobile applications.",
        "userTermId": 1,
        "termSeason": "Winter"
    }  
]